// 项目进度
export const projectProgressEnum = {
  0: '进行中',
  1: '已完成',
  2: '待完成',
};

//   管控状态
export const controlStatusEnum = {
  0: '无',
  1: '未配置',
  2: '管控中',
  3: '待完成',
  4: '延期配置',
  5: '已结束',
  6: '待判定',
  7: '延期审核中',
  8: '结束审核中',
};

//  预警状态
export const warningStatusEnum = {
  0: '正常',
  1: '黄色预警',
  2: '红色预警',
};

// 成本科目
export const costSubjectEnum = {
  0: '住宿费',
  1: '租车费',
  2: '餐费',
  3: '燃油费',
  4: '过路费',
  5: '评审费',
  6: '设备租赁费',
  7: '外拨',
  8: '项目建设费',
  9: '耗材费',
  10: '房租费',
  11: '餐补费',
  12: '其他',
};

// 里程碑管控状态
export const milestoneControlStatusEnum = {
  0: '待开始',
  1: '进行中',
  2: '待审核',
  3: '已完成',
};

// 项目类型
export const projectTypeEnum = {
  0: '小型项目',
  1: '一般项目',
  2: '大型项目',
  3: '特大型项目',
  4: '重大型项目',
};

// 专业类型
export const professionTypeEnum = {
  0: '现场检测',
  1: '技术咨询',
  2: '健康监测',
  3: '勘察设计',
  4: '软件开发',
  5: '室内检测',
  6: '驻地监测',
  7: '驻地检测',
  8: '咨询服务',
  9: '咨询评估',
  10: '工地实验室',
  11: '科研',
  12: '其他',
};

// 我的成本记录状态
export const myCostStatusEnum = {
  0: '待审核',
  1: '已通过',
  2: '已驳回',
  3: '失效作废',
};
